In [1]:
import pandas as pd
import numpy as np

## Task 1

In [2]:
data = {"Names":['Eeshwar','Dhruv','Sanj','Kriti','Anmol','Pranavesh','Gangadhar','Bhargavi','Nitin','Rishab'],
        "Reg_no":[8935,7247,8094,7453,8567,7243,7920,7999,7665,8243],
        'School':['SCOPE','SCOPE','SCOPE','SENSE','SCOPE','SCOPE','SCOPE','SCOPE','SENSE','SENSE'],
        "Course Type":["Specialisation",'Core','Core',"Specialisation","Specialisation","Specialisation",'Core','Core','Core',"Specialisation"],
        "Spz_name":['AI/ML',np.nan,np.nan,'CyberSec','Edge computing','AI/ML',np.nan,np.nan,np.nan,'AIML']}

In [3]:
df = pd.DataFrame(data)

In [4]:
df

       Names  Reg_no School     Course Type        Spz_name
0    Eeshwar    8935  SCOPE  Specialisation           AI/ML
1      Dhruv    7247  SCOPE            Core             NaN
2       Sanj    8094  SCOPE            Core             NaN
3      Kriti    7453  SENSE  Specialisation        CyberSec
4      Anmol    8567  SCOPE  Specialisation  Edge computing
5  Pranavesh    7243  SCOPE  Specialisation           AI/ML
6  Gangadhar    7920  SCOPE            Core             NaN
7   Bhargavi    7999  SCOPE            Core             NaN
8      Nitin    7665  SENSE            Core             NaN
9     Rishab    8243  SENSE  Specialisation            AIML

## Task 2

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Names        10 non-null     object
 1   Reg_no       10 non-null     int64
 2   School       10 non-null     object
 3   Course Type  10 non-null     object
 4   Spz_name     5 non-null      object
dtypes: int64(1), object(4)
memory usage: 528.0+ bytes

## Task 3

In [6]:
df.describe()

            Reg_no
count    10.000000
mean   7936.600000
std     555.907306
min    7243.000000
25%    7506.000000
50%    7959.500000
75%    8205.750000
max    8935.000000

## Task 4

In [7]:
df.loc[4]

Names                   Anmol
Reg_no                   8567
School                  SCOPE
Course Type    Specialisation
Spz_name       Edge computing
Name: 4, dtype: object

## Task 5

In [8]:
df.isnull()

   Names  Reg_no  School  Course Type  Spz_name
0  False   False   False        False     False
1  False   False   False        False      True
2  False   False   False        False      True
3  False   False   False        False     False
4  False   False   False        False     False
5  False   False   False        False     False
6  False   False   False        False      True
7  False   False   False        False      True
8  False   False   False        False      True
9  False   False   False        False     False